disease_dictionary = {  
    "呼吸道疾病": [  
        "感冒",  
        "急性上呼吸道感染",  
        "急慢性呼吸道感染",  
        "肺炎",  
        "肺结核",  
        "急性扁桃体炎",  
        "慢性支气管炎",  
        "支气管哮喘",  
        "急性鼻窦炎",  
        "咽喉炎"  
    ],  
    "胃肠道疾病": [  
        "胃溃疡",  
        "急慢性胃炎",  
        "胆囊炎",  
        "胆结石",  
        "阑尾炎",  
        "结肠炎",  
        "十二指肠溃疡",  
        "便秘",  
        "感染性腹泻"  
    ],  
    "心脑血管疾病": [  
        "高血压",  
        "冠心病",  
        "心力衰竭",  
        "心肌病",  
        "心包炎",  
        "先天性心脏病",  
        "心绞痛",  
        "心肌梗塞",  
        "脑出血",  
        "脑梗塞",  
        "脑血栓"  
    ],  
    "内分泌疾病": [  
        "糖尿病",  
        "骨质疏松",  
        "痛风",  
        "甲亢",  
        "甲状腺肿瘤"  
    ],  
    "其他疾病": [  
        "贫血",  
        "肾炎",  
        "尿路感染",  
        "白内障",  
        "青光眼"  
    ]  
}